In [2]:
import pandas as pd
import numpy as np
from surprise import Dataset

In [3]:
df_title= pd.read_csv('Movie_Id_Titles')
column_names = ['user_id', 'item_id', 'rating', 'timestamp']
df_title.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1682 entries, 0 to 1681
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  1682 non-null   int64
 1   title    1682 non-null   object
dtypes: int64(1), object(1)
memory usage: 26.4+ KB

In [4]:
movielens = Dataset.load_builtin('ml-100k')
movielens = pd.DataFrame(movielens.raw_ratings, columns = ['user_id', 'item_id', 'rating', 'timestamps'])
movielens.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   user_id     100000 non-null  object
 1   item_id     100000 non-null  object
 2   rating      100000 non-null  float64
 3   timestamps  100000 non-null  object
dtypes: float64(1), object(3)
memory usage: 3.1+ MB

In [5]:
movielens[['user_id', 'item_id', 'rating']] = movielens[['user_id', 'item_id', 'rating']].astype('int64')
movielens.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   user_id     100000 non-null  int64
 1   item_id     100000 non-null  int64
 2   rating      100000 non-null  int64
 3   timestamps  100000 non-null  object
dtypes: int64(3), object(1)
memory usage: 3.1+ MB

In [6]:
movielens = pd.merge(movielens, df_title, on = 'item_id')

In [7]:
movielens.head()

   user_id  item_id  rating timestamps         title
0      196      242       3  881250949  Kolya (1996)
1       63      242       3  875747190  Kolya (1996)
2      226      242       5  883888671  Kolya (1996)
3      154      242       3  879138235  Kolya (1996)
4      306      242       5  876503793  Kolya (1996)

In [8]:
movielens.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100000 entries, 0 to 99999
Data columns (total 5 columns):
 #   Column      Non-Null Count   Dtype
---  ------      --------------   -----
 0   user_id     100000 non-null  int64
 1   item_id     100000 non-null  int64
 2   rating      100000 non-null  int64
 3   timestamps  100000 non-null  object
 4   title       100000 non-null  object
dtypes: int64(3), object(2)
memory usage: 4.6+ MB

In [9]:
movielens[movielens['item_id'] == 50]

       user_id  item_id  rating timestamps             title
50711      290       50       5  880473582  Star Wars (1977)
50712       79       50       4  891271545  Star Wars (1977)
50713        2       50       5  888552084  Star Wars (1977)
50714        8       50       5  879362124  Star Wars (1977)
50715      274       50       5  878944679  Star Wars (1977)
...        ...      ...     ...        ...               ...
51289      749       50       5  878846978  Star Wars (1977)
51290      886       50       5  876031501  Star Wars (1977)
51291      739       50       4  886958895  Star Wars (1977)
51292      903       50       5  891031329  Star Wars (1977)
51293      780       50       5  891363685  Star Wars (1977)

[583 rows x 5 columns]

In [62]:
movielens.corr('pearson')

          user_id   item_id    rating
user_id  1.000000  0.010377 -0.009371
item_id  0.010377  1.000000 -0.189124
rating  -0.009371 -0.189124  1.000000

In [10]:
moviematrix = movielens.pivot_table(index = 'title', columns = 'user_id', values = 'rating')

In [69]:
moviematrix.head()

user_id,1,2,3,4,5,6,7,8,9,10,...,934,935,936,937,938,939,940,941,942,943
title,,,,,,,,,,,,,,,,,,,,,
'Til There Was You (1997),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1-900 (1994),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
101 Dalmatians (1996),2.0,NaN,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,...,2.0,NaN,NaN,2.0,4.0,NaN,NaN,NaN,NaN,NaN
12 Angry Men (1957),5.0,NaN,NaN,NaN,NaN,4.0,4.0,NaN,NaN,5.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
187 (1997),NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
cor = moviematrix.corr(method = 'pearson')

In [68]:
cor

user_id,1,2,3,4,5,6,7,8,9,10,...,934,935,936,937,938,939,940,941,942,943
user_id,,,,,,,,,,,,,,,,,,,,,
1,1.000000,1.608412e-01,0.112780,0.500000,0.420809,0.295410,2.581373e-01,0.692086,-0.102062,-0.092344,...,0.061695,-2.602417e-01,0.386346,0.029000,0.326744,5.343904e-01,0.263289,0.205616,-0.180784,0.067549
2,0.160841,1.000000e+00,0.067420,0.148522,0.327327,0.446966,6.436750e-01,0.585491,0.242536,0.668145,...,0.029341,-2.711631e-01,0.214017,0.566724,0.331587,1.380822e-16,-0.011682,-0.062017,0.085960,0.479702
3,0.112780,6.741999e-02,1.000000,-0.262600,NaN,-0.109109,6.480336e-02,0.291937,NaN,0.311086,...,0.000000,NaN,-0.045162,0.000000,-0.137523,NaN,-0.104678,1.000000,-0.011792,NaN
4,0.500000,1.485221e-01,-0.262600,1.000000,1.000000,-0.581318,-2.666324e-01,0.642938,NaN,-0.301511,...,0.866025,NaN,-0.203653,NaN,0.375000,NaN,0.850992,1.000000,0.412568,NaN
5,0.420809,3.273268e-01,NaN,1.000000,1.000000,0.241817,1.756302e-01,0.537400,0.577350,0.087343,...,0.229532,-5.000000e-01,0.439286,0.608581,0.484211,8.807048e-01,0.027038,0.468521,0.318163,0.346234
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
939,0.534390,1.380822e-16,NaN,NaN,0.880705,0.206315,1.714986e-01,-0.333333,NaN,0.316228,...,0.374351,-3.305898e-02,0.471172,-0.275839,-0.073374,1.000000e+00,-0.534522,-0.131306,-0.500000,-0.187317
940,0.263289,-1.168173e-02,-0.104678,0.850992,0.027038,-0.024419,9.312701e-04,0.320487,0.171499,0.158976,...,-0.125059,4.352858e-01,-0.338327,-0.148608,0.110022,-5.345225e-01,1.000000,0.632746,-0.022813,0.332497
941,0.205616,-6.201737e-02,1.000000,1.000000,0.468521,0.399186,-1.763144e-16,0.166667,1.000000,0.420084,...,-0.500000,3.925231e-17,0.273060,0.392953,-0.214147,-1.313064e-01,0.632746,1.000000,-0.577350,-0.395285
942,-0.180784,8.596024e-02,-0.011792,0.412568,0.318163,0.088758,4.520750e-01,0.201328,0.707107,0.408994,...,0.428806,-8.703883e-01,-0.216119,0.447214,0.244989,-5.000000e-01,-0.022813,-0.577350,1.000000,0.277433
943,0.067549,4.797016e-01,NaN,NaN,0.346234,0.109833,2.790809e-01,0.040741,0.927173,0.119523,...,0.081880,7.881104e-02,-0.117941,-0.742611,0.426501,-1.873172e-01,0.332497,-0.395285,0.277433,1.000000

In [152]:
top30_users = cor[290].sort_values(ascending = False).head(31)
top30_users.drop(290, inplace = True)
top30_users

user_id
451    1.000000
651    1.000000
131    1.000000
863    1.000000
252    1.000000
520    1.000000
578    1.000000
362    1.000000
724    1.000000
750    0.944911
209    0.942809
489    0.927173
797    0.912871
462    0.912871
799    0.904534
814    0.870388
134    0.866025
444    0.866025
482    0.866025
423    0.852803
742    0.840152
3      0.818182
310    0.788342
441    0.787296
590    0.759257
598    0.755929
212    0.752549
367    0.750000
104    0.748798
359    0.745957
Name: 290, dtype: float64

In [147]:
df_top30  = moviematrix[top30_users]

In [148]:
df_top30.head()

user_id,451,651,131,863,252,520,578,362,724,750,...,742,3,310,441,590,598,212,367,104,359
title,,,,,,,,,,,,,,,,,,,,,
'Til There Was You (1997),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1-900 (1994),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
101 Dalmatians (1996),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
12 Angry Men (1957),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
187 (1997),3.0,NaN,NaN,2.0,NaN,NaN,NaN,NaN,NaN,2.0,...,NaN,2.0,NaN,NaN,NaN,NaN,NaN,NaN,1.0,NaN

In [104]:
a = movielens[movielens['user_id']==451].sort_values(by = 'item_id', ascending = True)

       user_id  item_id  rating timestamps                        title
37         451      242       1  879012857                 Kolya (1996)
77597      451      243       4  879012510         Jungle2Jungle (1997)
19744      451      245       2  879012550      Devil's Own, The (1997)
25531      451      258       4  879012343               Contact (1997)
48538      451      259       4  879012721  George of the Jungle (1997)
...        ...      ...     ...        ...                          ...
97818      451     1296       3  879012685         Indian Summer (1996)
98851      451     1392       1  879012812          Locusts, The (1997)
41556      451     1393       2  879012812                  Stag (1997)
89520      451     1394       1  879012858    Swept from the Sea (1997)
99018      451     1395       1  879012858     Hurricane Streets (1998)

[98 rows x 5 columns]

In [25]:
b = movielens[movielens['user_id']==290].sort_values(by = 'item_id', ascending = True)

In [29]:
a1 = a[['item_id','rating']]
b1 = b[['item_id', 'rating']]

In [31]:
a1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 98 entries, 37 to 99018
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  98 non-null     int64
 1   rating   98 non-null     int64
dtypes: int64(2)
memory usage: 2.3 KB

In [32]:
b1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150 entries, 3623 to 23968
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   item_id  150 non-null    int64
 1   rating   150 non-null    int64
dtypes: int64(2)
memory usage: 3.5 KB

In [34]:
b1

       item_id  rating
3623         1       5
11155       15       4
18021       21       3
56802       22       5
62080       28       5
...        ...     ...
49031     1060       3
26740     1079       2
30538     1091       2
98224     1285       3
23968     1336       3

[150 rows x 2 columns]

In [39]:
b2 = b1['item_id'].tolist()
b2
a2 = a1['item_id'].tolist()

In [42]:
intersection = set(b2).intersection(a2)
intersection

{243, 323, 683}

In [114]:
a[a['item_id'] == 243]

       user_id  item_id  rating timestamps                 title
77597      451      243       4  879012510  Jungle2Jungle (1997)

In [113]:
b[b['item_id'] == 243]

       user_id  item_id  rating timestamps                 title
77580      290      243       3  880473474  Jungle2Jungle (1997)

In [79]:
a3.tail(30)

    item_id   b3
68      879  229
69      880  230
70      881  234
71      882  235
72      883  239
73      884  243
74      885  252
75      886  257
76      887  265
77      937  271
78      938  274
79      948  318
80      984  323
81      988  357
82      989  378
83      990  380
84      991  385
85      995  393
86     1022  402
87     1025  403
88     1026  404
89     1038  405
90     1265  418
91     1280  419
92     1295  423
93     1296  429
94     1392  432
95     1393  434
96     1394  435
97     1395  436

In [99]:
movielens[(movielens['item_id'] == 243 ) &(movielens['user_id'] == 290) ]

       user_id  item_id  rating timestamps                 title
77580      290      243       3  880473474  Jungle2Jungle (1997)